In [4]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [5]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, inspect

# Database connection parameters
DB_HOST     = '127.0.0.1'
DB_PORT     = '5433'        # <-- your Docker host port
DB_NAME     = 'knowthee'
DB_USER     = 'postgres'
DB_PASSWORD = 'postgres'

# Create connection URL and engine
DATABASE_URL = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(DATABASE_URL)

# Inspect database to get table names
inspector = inspect(engine)
tables = inspector.get_table_names()

# Loop through each table and display first 5 rows
for table in tables:
    print(f"\n### Table: {table}")
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5;", engine)
    display(df)

### Table: employees

,id,full_name,email,location,current_position,department,created_at,updated_at
0,368f2e74-1e89-4710-ac19-183a9e0caca3,Aaliyah Anderson,aanderson@yahoo.com,"Jacksonville, FL",,,2025-06-16 08:48:15.437153+00:00,None
1,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Aaliyah Williams,aaliyah.williams@gmail.com,"San Antonio, TX",,,2025-06-16 08:48:15.450549+00:00,None
2,70de353c-a675-4264-81d9-9078d1a0d68f,Aaliyah Wilson,awilson@outlook.com,"Jacksonville, FL",,,2025-06-16 08:48:15.457945+00:00,None
3,150a55ce-eef6-4671-8a65-0f6cb791488a,Ahmed Al-Ahmad,ahmedal-ahmad@yahoo.com,,,,2025-06-16 08:48:15.468017+00:00,None
4,8b3b3502-1cf9-4af7-a328-c53bd5080468,Ahmed Farouk,afarouk@gmail.com,"New York, NY",,,2025-06-16 08:48:15.475599+00:00,None

### Table: employee_contacts

,id,employee_id,type,value,is_primary,created_at,updated_at
0,69c1bc50-e3db-49f2-98ba-2050e929b2f1,368f2e74-1e89-4710-ac19-183a9e0caca3,email,aanderson@yahoo.com,True,2025-06-16 08:48:15.437153+00:00,None
1,800bd9d1-ab57-4169-a388-c2ebedb90347,368f2e74-1e89-4710-ac19-183a9e0caca3,phone,(585) 704-8170,True,2025-06-16 08:48:15.437153+00:00,None
2,455a0754-42bd-4b79-926a-a1d0482f7591,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,email,aaliyah.williams@gmail.com,True,2025-06-16 08:48:15.450549+00:00,None
3,ffbbd3bd-de50-4b2f-8d4c-e5d1dfa21f48,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,phone,(616) 235-8448,True,2025-06-16 08:48:15.450549+00:00,None
4,c4e16a2e-6e8d-451d-b29a-6520b572a879,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,linkedin,linkedin.com/in/aaliyah-williams-841,False,2025-06-16 08:48:15.450549+00:00,None

### Table: idi_scores

,id,assessment_id,category,dimension,score,created_at,updated_at
0,75da053f-a14c-4af9-81ca-8593d50b828c,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Giving,25,2025-06-16 08:48:19.407123+00:00,None
1,7f074265-58fb-4378-9da8-a896d8c4006d,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Receiving,40,2025-06-16 08:48:19.407123+00:00,None
2,ffaa8596-c389-4026-89df-7e1031f720a6,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Belonging,75,2025-06-16 08:48:19.407123+00:00,None
3,5250df44-b741-4327-babd-5cf42dd39e40,9e8b266c-d3ea-4e21-a549-cd20706506de,AFFILIATING,Expressing,50,2025-06-16 08:48:19.407123+00:00,None
4,bc2a4ea5-28e2-43f2-8b13-ab3ee1b70bf4,9e8b266c-d3ea-4e21-a549-cd20706506de,ATTRACTING,Stature,20,2025-06-16 08:48:19.407123+00:00,None

### Table: employee_education

,id,employee_id,degree,field,institution,start_date,end_date,created_at,updated_at
0,6b6bc24b-d32d-4424-b402-ac4fc0ecd7ff,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Princeton University,2020-01-01,None,2025-06-16 08:48:15.437153+00:00,None
1,8ffdbd59-5ad0-4d48-a927-b3c6543614be,368f2e74-1e89-4710-ac19-183a9e0caca3,,,Ohio State University,2016-01-01,None,2025-06-16 08:48:15.437153+00:00,None
2,4b6a7760-392a-415f-a7ea-93ba22a71267,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Cornell University,1998-01-01,None,2025-06-16 08:48:15.450549+00:00,None
3,b34adaae-3c13-4286-bb4d-344dd952e0ed,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,,,Georgia Institute of Technology,1994-01-01,None,2025-06-16 08:48:15.450549+00:00,None
4,3c805b78-dfc6-4ccf-af08-8ae33b567764,150a55ce-eef6-4671-8a65-0f6cb791488a,,,Princeton University,2019-01-01,None,2025-06-16 08:48:15.468017+00:00,None

### Table: employee_experiences

,id,employee_id,title,company,start_date,end_date,description,created_at,updated_at
0,4e42d636-d4ba-4eaa-b731-58523df3df74,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
1,bac90c44-cad1-4522-a510-cac507db12af,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
2,cda8fd44-5be9-4763-b22d-3aa3aa02f77f,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
3,b360ad21-5193-4719-9f29-f8fe7fd2e307,368f2e74-1e89-4710-ac19-183a9e0caca3,Recruiter,Deloitte,2025-01-01,None,Recruited 148 candidates with 26% retention ra...,2025-06-16 08:48:15.437153+00:00,None
4,1a1e723e-98c7-4ed3-aeb4-0ebdc6e07beb,70de353c-a675-4264-81d9-9078d1a0d68f,Bookkeeper,Yale University,2022-01-01,None,Performed due diligence for $378K M&A transact...,2025-06-16 08:48:15.457945+00:00,None

### Table: employee_skills

,id,employee_id,skill,type,created_at,updated_at
0,30e1547a-6dca-49c6-b2e4-476c13b824b2,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Jira,technical,2025-06-16 08:48:15.764319+00:00,None
1,96db8174-087b-47dd-9d96-346655b6a18b,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,React,technical,2025-06-16 08:48:15.764319+00:00,None
2,28550560-8ccd-4ebb-8fbf-89dff0ea6fac,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,SVN,technical,2025-06-16 08:48:15.764319+00:00,None
3,5c46173c-ba42-4abc-8900-0acebe2e365d,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,DynamoDB,technical,2025-06-16 08:48:15.764319+00:00,None
4,79b99e4b-fd1a-4247-abb8-338c9fc37c38,23c7af1d-1e9f-40ab-8f0e-f6337a3a016c,Python,technical,2025-06-16 08:48:15.764319+00:00,None

### Table: employee_assessments

,id,employee_id,assessment_type,assessment_date,source_filename,status,notes,created_at,updated_at
0,605fd2a9-4999-4a70-81e8-b9ded4aca916,368f2e74-1e89-4710-ac19-183a9e0caca3,Hogan,2025-05-08,,active,None,2025-06-16 08:48:17.722466+00:00,None
1,8117cf36-d75d-4809-bf4d-bda69c59bdcb,0a6d7df3-7e2f-483b-b6c2-c31c2a7e1d15,Hogan,2025-04-12,,active,None,2025-06-16 08:48:17.732572+00:00,None
2,13e1961f-35ed-4738-91d8-1a36d36575c3,70de353c-a675-4264-81d9-9078d1a0d68f,Hogan,2025-05-19,,active,None,2025-06-16 08:48:17.740209+00:00,None
3,73dd7828-598d-4276-a4b7-e67308efb584,150a55ce-eef6-4671-8a65-0f6cb791488a,Hogan,2025-01-02,,active,None,2025-06-16 08:48:17.748807+00:00,None
4,87bc9cef-67b7-4e57-9ad4-b26afac79e00,8b3b3502-1cf9-4af7-a328-c53bd5080468,Hogan,2025-05-15,,active,None,2025-06-16 08:48:17.756277+00:00,None

### Table: hogan_scores

,id,assessment_id,trait,score,created_at,updated_at
0,fd538e1d-958d-4ef4-8bc5-4d35bf084482,605fd2a9-4999-4a70-81e8-b9ded4aca916,May,8,2025-06-16 08:48:17.722466+00:00,None
1,cbbda007-4ec9-407d-b503-ed46465703fa,605fd2a9-4999-4a70-81e8-b9ded4aca916,Adjustment,57,2025-06-16 08:48:17.722466+00:00,None
2,3f87a655-e154-4dd9-a6d2-973609d8668e,605fd2a9-4999-4a70-81e8-b9ded4aca916,Ambition,30,2025-06-16 08:48:17.722466+00:00,None
3,935d063d-1049-459c-a846-c7522d167651,605fd2a9-4999-4a70-81e8-b9ded4aca916,Sociability,86,2025-06-16 08:48:17.722466+00:00,None
4,a6cc62e2-01e7-4158-9aad-f807c58a4bc9,605fd2a9-4999-4a70-81e8-b9ded4aca916,Interpersonal Sensitivity,79,2025-06-16 08:48:17.722466+00:00,None

### Table: document_embeddings

Empty DataFrame
Columns: [id, employee_id, source, embedding, created_at, updated_at]
Index: []

### Table: embedding_documents

Empty DataFrame
Columns: [id, employee_id, assessment_id, embedding_run_id, type, filename, created_at, updated_at]
Index: []

### Table: embedding_runs

Empty DataFrame
Columns: [id, name, chunking_method, embedding_model, created_at, updated_at]
Index: []

### Table: embedding_chunks

Empty DataFrame
Columns: [id, document_id, chunk_index, content, embedding, created_at, updated_at]
Index: []